sterentev/atdf-device-asm-include/inc/AT90CAN64.inc
; ----------	Register CANEN1 bits		------------------------
.equ	CANEN1_ENMOB_MASK= 0x7F		;      - Enable MOb (7 bits)
.equ	CANEN1_ENMOB0	= 0		;          CANEN1_ENMOB BIT0 position

; ----------	Register CANIE2 bits		------------------------
.equ	CANIE2_IEMOB_MASK= 0xFF		;      - Interrupt Enable by MOb (8 bits)
.equ	CANIE2_IEMOB0	= 0		;          CANIE2_IEMOB BIT0 position

; ----------	Register CANIE1 bits		------------------------
.equ	CANIE1_IEMOB_MASK= 0x7F		;      - Interrupt Enable by MOb (7 bits)
.equ	CANIE1_IEMOB0	= 0		;          CANIE1_IEMOB BIT0 position

; ----------	Register CANSIT2 bits		------------------------
.equ	CANSIT2_SIT_MASK= 0xFF		;      - Status of Interrupt by MOb (8 bits)
.equ	CANSIT2_SIT0	= 0		;          CANSIT2_SIT BIT0 position

; ----------	Register CANSIT1 bits		------------------------
.equ	CANSIT1_SIT_MASK= 0x7F		;      - Status of Interrupt by MOb (7 bits)
.equ	CANSIT1_SIT0	= 0		;          CANSIT1_SIT BIT0 position

; ----------	Register CANBT1 bits		------------------------
.equ	BRP_MASK	= 0x7E		;      - Baud Rate Prescaler bits (6 bits)
.equ	BRP0		= 1		;          BRP BIT0 position

; ----------	Register CANBT2 bits		------------------------
.equ	SJW_MASK	= 0x60		;      - Re-Sync Jump Width (2 bits)
.equ	SJW0		= 5		;          SJW BIT0 position
.equ	PRS_MASK	= 0x0E		;      - Propagation Time Segment (3 bits)
.equ	PRS0		= 1		;          PRS BIT0 position

; ----------	Register CANBT3 bits		------------------------
.equ	PHS2_MASK	= 0x70		;      - Phase Segments (3 bits)
.equ	PHS20		= 4		;          PHS2 BIT0 position
.equ	PHS1_MASK	= 0x0E		;      - Phase Segment 1 (3 bits)
.equ	PHS10		= 1		;          PHS1 BIT0 position
.equ	SMP		= 0		; 0x01 - Sample Type

; ----------	Register CANTCON bits		------------------------
.equ	TPRSC_MASK	= 0xFF		;      - CAN Timer Prescaler (8 bits)
.equ	TPRSC0		= 0		;          TPRSC BIT0 position

; ----------	Register CANTIM bits		------------------------
.equ	CANTIM_MASK	= 0xFFFF	;      - CAN Timer Count (16 bits)
.equ	CANTIM0		= 0		;          CANTIM BIT0 position

; ----------	Register CANTTC bits		------------------------
.equ	TIMTTC_MASK	= 0xFFFF	;      - TTC Timer Count (16 bits)
.equ	TIMTTC0		= 0		;          TIMTTC BIT0 position

; ----------	Register CANTEC bits		------------------------
.equ	TEC_MASK	= 0xFF		;      - Transmit Error Count (8 bits)
.equ	TEC0		= 0		;          TEC BIT0 position

; ----------	Register CANREC bits		------------------------
.equ	REC_MASK	= 0xFF		;      - Receive Error Count (8 bits)
.equ	REC0		= 0		;          REC BIT0 position

; ----------	Register CANHPMOB bits		------------------------
.equ	HPMOB_MASK	= 0xF0		;      - Highest Priority MOb number (4 bits)
.equ	HPMOB0		= 4		;          HPMOB BIT0 position
.equ	CGP_MASK	= 0x0F		;      - CAN General purpose bits (4 bits)
.equ	CGP0		= 0		;          CGP BIT0 position

; ----------	Register CANPAGE bits		------------------------
.equ	MOBNB_MASK	= 0xF0		;      - MOb Number Bits (4 bits)
.equ	MOBNB0		= 4		;          MOBNB BIT0 position
.equ	AINC		= 3		; 0x08 - MOb Data Buffer Auto Increment
.equ	INDX_MASK	= 0x07		;      - Data Buffer Index Bits (3 bits)
.equ	INDX0		= 0		;          INDX BIT0 position

; ----------	Register CANSTMOB bits		------------------------
.equ	DLCW		= 7		; 0x80 - Data Length Code Warning
.equ	TXOK		= 6		; 0x40 - Transmit OK
.equ	RXOK		= 5		; 0x20 - Receive OK
.equ	BERR		= 4		; 0x10 - Bit Error
.equ	SERR		= 3		; 0x08 - Stuff Error
.equ	CERR		= 2		; 0x04 - CRC Error
.equ	FERR		= 1		; 0x02 - Form Error
.equ	AERR		= 0		; 0x01 - Acknowledgement Error

; ----------	Register CANCDMOB bits		------------------------
.equ	CONMOB_MASK	= 0xC0		;      - MOb Config Bits (2 bits)
.equ	CONMOB0		= 6		;          CONMOB BIT0 position
.equ	RPLV		= 5		; 0x20 - Reply Valid
.equ	IDE		= 4		; 0x10 - Identifier Extension
.equ	DLC_MASK	= 0x0F		;      - Data Length Code Bits (4 bits)
.equ	DLC0		= 0		;          DLC BIT0 position

; ----------	Register CANIDT4 bits		------------------------
.equ	CANIDT4_IDT_MASK= 0xF8		;      - Identifier Tag (5 bits)
.equ	CANIDT4_IDT0	= 3		;          CANIDT4_IDT BIT0 position
.equ	RTRTAG		= 2		; 0x04 - Remote Transmission Request Tag
.equ	RB1TAG		= 1		; 0x02 - Reserved Bit 1 Tag
.equ	RB0TAG		= 0		; 0x01 - Reserved Bit 0 Tag

; ----------	Register CANIDT3 bits		------------------------
.equ	CANIDT3_IDT_MASK= 0xFF		;      - Identifier Tag (8 bits)
.equ	CANIDT3_IDT0	= 0		;          CANIDT3_IDT BIT0 position

; ----------	Register CANIDT2 bits		------------------------
.equ	CANIDT2_IDT_MASK= 0xFF		;      - Identifier Tag (8 bits)
.equ	CANIDT2_IDT0	= 0		;          CANIDT2_IDT BIT0 position

; ----------	Register CANIDT1 bits		------------------------
.equ	CANIDT1_IDT_MASK= 0xFF		;      - Identifier Tag (8 bits)
.equ	CANIDT1_IDT0	= 0		;          CANIDT1_IDT BIT0 position

; ----------	Register CANIDM4 bits		------------------------
.equ	CANIDM4_IDMSK_MASK= 0xF8		;      - Identifier Mask (5 bits)
.equ	CANIDM4_IDMSK0	= 3		;          CANIDM4_IDMSK BIT0 position
.equ	RTRMSK		= 2		; 0x04 - Remote Transmission Request Mask
.equ	IDEMSK		= 0		; 0x01 - Identifier Extension Mask

; ----------	Register CANIDM3 bits		------------------------
.equ	CANIDM3_IDMSK_MASK= 0xFF		;      - Identifier Mask (8 bits)
.equ	CANIDM3_IDMSK0	= 0		;          CANIDM3_IDMSK BIT0 position

; ----------	Register CANIDM2 bits		------------------------
.equ	CANIDM2_IDMSK_MASK= 0xFF		;      - Identifier Mask (8 bits)
.equ	CANIDM2_IDMSK0	= 0		;          CANIDM2_IDMSK BIT0 position

; ----------	Register CANIDM1 bits		------------------------
.equ	CANIDM1_IDMSK_MASK= 0xFF		;      - Identifier Mask (8 bits)
.equ	CANIDM1_IDMSK0	= 0		;          CANIDM1_IDMSK BIT0 position

; ----------	Register CANSTM bits		------------------------
.equ	TIMSTM_MASK	= 0xFFFF	;      - Time Stamp Count (16 bits)
.equ	TIMSTM0		= 0		;          TIMSTM BIT0 position

; ----------	Register CANMSG bits		------------------------
.equ	MSG_MASK	= 0xFF		;      - Message Data (8 bits)
.equ	MSG0		= 0		;          MSG BIT0 position




